string = """
汉族，已婚，因“突发右侧肢体无力2天。”门诊拟“脑出血”于2016-03-22收入院。入院查体：T 36.5℃，P 60bpm，R 16bpm，BP 169／83mmHg。NIHSS评分2分，
洼田饮水试验4分，GCS15分。神清，双下肺可闻及少量湿罗音，言语可，伸舌居中，双侧鼻唇沟对称，右侧肢体肌力4级，右侧病理征阳性。住院期间主要检查结果：
2016-3-23心肌酶、肝功能、肿瘤指标正常。血常规：中性粒细胞计数11.33x10^9/L，白细胞计数13.37x10^9/L，中性粒细胞84.8%，余正常。
尿常规：红细胞计数(仪器)3.8个/HP，白细胞计数(仪器)1.3个/HP，红细胞计数(仪器)31.60/ul，上皮细胞数(仪器)12.90/ul，患者无尿频、尿急、尿痛，
随访。总蛋白60g/L，白蛋白33g/L，白蛋白/球蛋白1.22，随访。肾功能：尿素8.8mmol/L，肌酐、尿酸正常。2016-3-23血脂：高密度脂蛋白胆固醇1.73mmol/L，
低密度脂蛋白胆固醇2.54mmol/L，余正常。血浆D-二聚体12.85μg/ml。凝血指标：凝血酶原时间14.4s，纤维蛋白降解产物28.34μg/ml，活化部分凝血活酶时间43.8s，
余正常。乙肝指标：乙型肝炎核心抗体Anti-HBc阳性 1.59S/CO，乙型肝炎e抗体Anti-HBe阳性 0.66S/CO，余正常。丙型肝炎抗体IgG(化学发光法)阴性，
HIV抗原抗体(酶联免疫法)阴性，梅毒抗体(化学发光法)阴性。糖化血红蛋白5.8%。游离前列腺抗原、前列腺特异抗原阴性。2016/3/24血气：肺泡动脉氧分压25.10mmHg20，
缓冲碱5.00mmol/L，氧合血红蛋白95.20%，实际碳酸氢盐浓度28.50mmol/L，标准碳酸氢盐浓度28.60mmol/L，二氧化碳分压37.90mmHg，pH值7.495，氧分压84.90mmHg，
随访。粪常规、粪阴性正常。2016.2.28抗O、RF正常。血常规：白细胞计数16.30x10^9/L，中性粒细胞计数13.48x10^9/L，中性粒细胞82.7%。
2016-3-28红细胞沉降率42mm/H。电解质：氯95mmol/L，钠、氯正常。肾功能：尿素7.9mmol/L，尿酸、肌酐正常。葡萄糖6.4mmol/L。
2016-3-27咽拭子细菌结果未生长流感嗜血杆菌、生长非致病性奈瑟菌、草绿色链球菌。2016-3-26咽拭子细菌结果未生长流感嗜血杆菌、生长非致病性奈瑟菌、
草绿色链球菌。颈部MRA颅内多发动脉硬化狭窄。心电图：窦性心率，房性早搏。腹部超声：脂肪肝、左肾囊肿，前列腺增大伴囊肿，脾脏、右肾未见明显异常。
心脏超声：心脏各房室大小比例尚可，左室肌顺应性下降，左室收缩功能正常，心包积液。3.24头颅CT:左侧基底节区脑出血，较前片（2016-3-21）相仿，请随访
碳酸氢盐浓度28.60mmol/L，二氧化碳分压37.90mmHg，pH值7.495，氧分压84.90mmHg，随访。粪常规、粪阴性正常。2016.2.28抗O、RF正常。血常规：
白细胞计数16.30x10^9/L，中性粒细胞计数13.48x10^9/L，中性粒细胞82.7%。2016-3-28红细胞沉降率42mm/H。电解质：氯95mmol/L，钠、氯正常。
肾功能：尿素7.9mmol/L，尿酸、肌酐正常。葡萄糖6.4mmol/L。2016-3-27咽拭子细菌结果未生长流感嗜血杆菌、生长非致病性奈瑟菌、草绿色链球菌。
2016-3-26咽拭子细菌结果未生长流感嗜血杆菌、生长非致病性奈瑟菌、草绿色链球菌。颈部MRA颅内多发动脉硬化狭窄。心电图：窦性心率，房性早搏。
腹部超声：脂肪肝、左肾囊肿，前列腺增大伴囊肿，脾脏、右肾未见明显异常。心脏超声：心脏各房室大小比例尚可，左室肌顺应性下降，左室收缩功能正常，
心包积液。3.24头颅CT:左侧基底节区脑出血，较前片（2016-3-21）相仿，请随访
"""
