clear all;
%%% 为大于等于30模型
%%% 目标函数带常数非要写在 优化里面的话。
%%%  在不等式约束处加多一列 0 ,在等式约束处，约束这个为 1
%%% problem1 说明：第一问情况下目标函数选取误差和价钱最小，同时限制不等式约束条件中的金钱量小于等于500/7；
food=45;
% [x,fval] =linprog(f,A,b,Aeq,beq,lb);
w1=1; %%价钱权重,第一题价钱决定
% w1=0:1;
w2=1-w1;
S=40;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 
% f1_sum=xlsread('数据.xlsx','sheet1','AB2:AB46')';  %%最小花费
Q=xlsread('可食用.xlsx','sheet1','A1:A45')';%%可使用部分45个
B=xlsread('数据汇总.xlsx','sheet1','B2:X46');%%第i种食物中第j个营养含量；45*23
N=xlsread('参考摄入量.xlsx','sheet1','B15:X15');%%第j种营养含量的需求量23
P=xlsread('数据汇总.xlsx','sheet1','Z2:Z46')';%%每100g个食物的价钱45个
L=xlsread('参考摄入量.xlsx','sheet1','B2:B10')';%%每9种食物类别的最小摄入量
R=xlsread('参考摄入量.xlsx','sheet1','C2:C10')';%%每9种食物类别的最大摄入量
%%f %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%   f  系数为P价钱，权重
P1(1:45,1)=0;
for f_1=1:45
    P1(f_1,1)=w1*P(1,f_1)/S;
end
f1(1:44,1)=w2/22;
f=[P1;f1];

%%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%  E=Q*B 每个营养摄入量
E(1:23,1:89)=0;
for lv=1:45
    E(1,lv)=Q(1,lv)*B(lv,1);%%热量摄入
end
for q=2:23
    for i=1:45
    E(q,i)=(-1)*Q(1,i)*B(i,q);
    end
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% yueshu  每种种类摄入量范围
yueshu(1:18,1:89)=0;
yueshu(1,1:5)=1;yueshu(2,6:10)=1;yueshu(3,11:15)=1;yueshu(4,16:20)=1;yueshu(5,21:25)=1;yueshu(6,26:30)=1;
yueshu(7,31:35)=1;yueshu(8,36:40)=1;yueshu(9,41:45)=1;yueshu(10,1:5)=-1;yueshu(11,6:10)=-1;yueshu(12,11:15)=-1;
yueshu(13,16:20)=-1;yueshu(14,21:25)=-1;yueshu(15,26:30)=-1;yueshu(16,31:35)=-1;yueshu(17,36:40)=-1;yueshu(18,41:45)=-1;
%%A%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%   AAAAAAAAAAAAA
down(1,1:89)=0;%%原来45个食物加上44个转变量再加一个常熟
for do=1:45
    down(1,do)=(1)*P(1,do);
end
A=[E;yueshu;down];
%%b%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%   bbbbbbbbbbbbb
b(1:42,1)=0;%%原来为23+18，先再加一
b(1,1)=2300;
% b(42,1)=(-1)*S;
b(42,1)=500/7;
for b1=2:23
    b(b1,1)=(-1)*0.96*N(1,b1);
end
for b2=24:32
    b(b2,1)=R(1,b2-23);
end
for b3=33:41
    b(b3,1)=(-1)*L(1,b3-32);
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%  绝对值Aeq1 营养摄入量
Aeq1(1:22,1:45)=0;
for j=1:20
    for n=1:45
        Aeq1(j,n)=Q(1,n)*B(n,j+1)/N(1,j+1);
    end
end
%%%%%%%%%%%%%%%%%%%%%  绝对值Aeq2  为绝对值拆开后的值u，v
Aeq2(1:22,1:44)=0;
Aeq2(1,1)=-1;Aeq2(1,2)=1;
Aeq2(2,3)=-1;Aeq2(2,4)=1;
Aeq2(3,5)=-1;Aeq2(3,6)=1;
Aeq2(4,7)=-1;Aeq2(4,8)=1;
Aeq2(5,9)=-1;Aeq2(5,10)=1;
Aeq2(6,11)=-1;Aeq2(6,12)=1;
Aeq2(7,13)=-1;Aeq2(7,14)=1;
Aeq2(8,15)=-1;Aeq2(8,16)=1;
Aeq2(9,17)=-1;Aeq2(9,18)=1;
Aeq2(10,19)=-1;Aeq2(10,20)=1;
Aeq2(11,21)=-1;Aeq2(11,22)=1;
Aeq2(12,23)=-1;Aeq2(12,24)=1;
Aeq2(13,25)=-1;Aeq2(13,26)=1;
Aeq2(14,27)=-1;Aeq2(14,28)=1;
Aeq2(15,29)=-1;Aeq2(15,30)=1;
Aeq2(16,31)=-1;Aeq2(16,32)=1;
Aeq2(17,33)=-1;Aeq2(17,34)=1;
Aeq2(18,35)=-1;Aeq2(18,36)=1;
Aeq2(19,37)=-1;Aeq2(19,38)=1;
Aeq2(20,39)=-1;Aeq2(20,40)=1;
Aeq2(21,41)=-1;Aeq2(21,42)=1;
Aeq2(22,43)=-1;Aeq2(22,44)=1;
%%Aeq%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%   Aeq
Aeq=[Aeq1,Aeq2];

%%beq%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%   beq    等号右边为1
beq(1:22,1)=1;


%%lb%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%  lb
lb(1:89,1)=0;%%x的所有值大于等于0，从xexcel中取


%%f%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%    函数
 [x,fval] =linprog(f,A,b,Aeq,beq,lb);
 
 sum=0;
 wrong=0;
 for xi=1:45
 result=x(xi,1)*P(1,xi);
 sum=sum+result;
 end
 for xwrong=46:89
     wrong=wrong+x(xwrong,1);
 end
 evaluate=w2*wrong/22+w1*sum/S;